Revit 2027 API
BRepBuilder.IsValidEdgeId Method
 A validator function that checks whether the edge id corresponds to an edge previously added to this BRepBuilder object.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsValidEdgeId(
	BRepBuilderGeometryId edgeId
)
Public Function IsValidEdgeId (
	edgeId As BRepBuilderGeometryId
) As Boolean
public:
bool IsValidEdgeId(
	BRepBuilderGeometryId^ edgeId
)
member IsValidEdgeId :
        edgeId : BRepBuilderGeometryId -> bool
Parameters
edgeId BRepBuilderGeometryId
 Edge id to be validated.
Return Value
Boolean
 True if edgeId corresponds to an edge previously added to this BRepBuilder, false otherwise.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
BRepBuilder Class
Autodesk.Revit.DB Namespace